<?php include("header.php"); ?>
<div class="w3-content w3-padding" style="max-width:1564px">
<div class="w3-row-padding w3-padding-64 w3-container">
  <div class="w3-content">
    <div class="w3-twothird">
      <h1><font color="orange">1.คอมพิวเตอร์คืออะไร</h1></font>
      <p><font size="4">คอมพิวเตอร์ คือ อุปกรณ์ทางอิเล็กทรอนิกส์ (electrinic device) ที่มนุษย์ใช้เป็นเครื่องมือช่วยในการจัดการกับข้อมูลที่อาจเป็นได้ ทั้งตัวเลข ตัวอักษร หรือสัญลักษณ์ที่ใช้แทนความหมายในสิ่งต่าง ๆ โดยคุณสมบัติที่สำคัญของคอมพิวเตอร์คือการที่สามารถกำหนดชุดคำสั่งล่วงหน้าหรือโปรแกรมได้ (programmable) นั่นคือคอมพิวเตอร์  สามารถทำงานได้หลากหลายรูปแบบ ขึ้นอยู่กับชุดคำสั่งที่เลือกมาใช้งาน ทำให้สามารถนำคอมพิวเตอร์ไปประยุกต์ใช้งานได้อย่างกว้างขวาง เช่น ใช้ในการตรวจคลื่นความถี่ของหัวใจ การฝาก - ถอนเงินในธนาคาร การตรวจสอบ   สภาพเครื่องยนต์ เป็นต้น ข้อดีของคอมพิวเตอร์ คือ เครื่องคอมพิวเตอร์สามารถทำงานได้อย่างมีประสิทธภาพ มีความถูกต้อง และมีความรวดเร็วอย่างไรก็ดี ไม่ว่าจะเป็นงานชนิดใดก็ตาม  เครื่องคอมพิวเตอร์จะมีวงจรการทำงานพื้นฐาน 4 อย่าง  คือ

      รับข้อมูล (Input) เครื่องคอมพิวเตอร์จะทำการรับข้อมูลจากหน่วยรับข้อมูล (input unit) เช่น คีบอร์ด หรือ เมาส์
      ประมวลผล (Processing) เครื่องคอมพิวเตอร์จะทำการประมวลผลกับข้อมูล เพื่อแปลงให้อยู่ในรูปอื่นตามที่ต้องการ
      แสดงผล (Output) เครื่องคอมพิวเตอร์จะให้ผลลัพธ์จากการประมวลผลออกมายังหน่วยแสดงผลลัพธ์ (output unit) เช่น เครื่องพิมพ์ หรือจอภาพ
      เก็บข้อมูล (Storage) เครื่องคอมพิวเตอร์จะทำการเก็บผลลัพธ์จากการประมวลผลไว้ในหน่วยเก็บข้อมูล เพื่อให้สามารถนำมาใช้ใหม่ได้ในอนาคต.</font></p>
      <h2>คุณสมบัติของคอมพิวเตอร์</h2>
      <p><font size="4">ปัจจุบันนี้คนส่วนใหญ่นิยมนำคอมพิวเตอร์มาใช้งานต่าง ๆ มากมาย ซึ่งผู้ใช้ส่วนใหญ่มักจะคิดว่าคอมพิวเตอร์เป็นเครื่องมือที่สามารถทำงานได้สารพัด แต่ผู้ที่มีความรู้ทางคอมพิวเตอร์จะทราบว่า งานที่เหมาะกับการนำคอมพิวเตอร์มาใช้อย่างยิ่งคือการสร้างสารสนเทศ ซึ่งสารสนเทศเหล่านั้นสามารถนำมาพิมพ์ออกทางเครื่องพิมพ์ ส่งผ่านเครือข่ายคอมพิวเตอร์ หรือจัดเก็บไว้ใช้ในอนาคนก็ได้ เนื่องจากคอมพิวเตอร์จะมีคุณสมบัติต่าง ๆ คือ

      ความเร็ว (speed) คอมพิวเตอร์ในปัจจุบันนี้สามารถทำงานได้ถึงร้อยล้านคำสั่งในหนึ่งวินาที
      ความเชื่อถือ (reliable) คอมพิวเตอร์ทุกวันนี้จะทำงานได้ทั้งกลางวันและกลางคืนอย่างไม่มีข้อผิดพลาด และไม่รู้จักเหน็ดเหนื่อย
      ความถูกต้องแม่นยำ (accurate) วงจรคอมพิวเตอร์นั้นจะให้ผลของการคำนวณที่ถูกต้องเสมอหากผลของการคำนวณผิดจากที่ควรจะเป็น มักเกิดจากความผิดพลาดของโปรแกรมหรือข้อมูลที่เข้าสู่โปรแกรม
      เก็บข้อมูลจำนวนมาก ๆ ได้ (store massive amounts of information) ไมโครคอมพิวเตอร์ในปัจจุบัน จะมีที่เก็บข้อมูลสำรองที่มีความสูงมากกว่าหนึ่งพันล้านตัวอักษร และสำหรับระบบคอมพิวเตอร์ขนาดใหญ่จะสามารถเก็บข้อมูลได้มากกว่าหนึ่งล้าน ๆ ตัวอักษร
      ย้ายข้อมูลจากที่หนึ่งไปยังอีกทีหนึ่งได้อย่างรวดเร็ว (move information) โดยใช้การติดต่อสื่อสารผ่านระบบ เครือข่ายคอมพิวเตอร์ ซึ่งสามารถส่งพจนานุกรมหนึ่งเล่มในรูปของข้อมูลอิเล็กทรอนิกส์ ไปยังเครื่องคอมพิวเตอร์ที่อยู่ไกลคนซีกโลกได้ในเวลาเพียงไม่ถึงหนึ่งวินาที ทำให้มีการเรียกเครือข่ายคอมพิวเตอร์ที่เชื่อมกันทั่วโลกในปัจจุบันว่า ทางด่วนสารสนเทศ (Information Superhighway)
      ผู้ที่สนใจศึกษาทางด้านคอมพิวเตอร์ จะต้องศึกษาหลักการทำงานพื้นฐานของเครื่องคอมพิวเตอร์และโปรแกรมประยุกต์ต่าง ๆ รวมทั้งจะต้องศึกษาถึงผลกระทบจากคอมพิวเตอร์ต่อสังคมในวันนี้ ทั้งในแง่บวกและแง่ลบ โดยในแง่บวกนั้นจะมองเห็นได้ง่ายจากสภาพแวดล้อมทั่วไป นั่นคือทำให้สามารถทำงานต่าง ๆ ได้อย่างสะดวกและรวดเร็วขึ้น เริ่มตั้งแต่การจัดเก็บเอกสาร การพิมพ์จดหมาย การจัดทำหนังสือพิมพ์และวารสารต่าง ๆ การฝาก - ถอนเงินในธนาคาร การจ่างเงินซื้อสินค้า ตรวจความผิดปกติของทารกในครรภ์ และในทางการแพทย์อื่น ๆ อีกมากมาย.</font></p>

      <h2>ในแง่ลบก็มีไม่น้อย เช่น</h2>
      <p><font size="4">โรงงานผลิตอุปกรณ์ของเครื่องคอมพิวเตอร์นั้นต้องใช้สารเคมีเป็นจำนวนมาก ซึ่งจะทำให้เกิดมลพิษต่าง ๆ มากมาย ผู้ใช้อาจมีอาการเจ็บป่วยที่เกิดจากการทำงานกับเครื่องคอมพิวเตอร์เป็นเวลานาน ๆ เช่น อาจมีการปวดหลังไหล่ที่เกิดจากการนั่งอยู่หน้าเครื่องนาน ๆ หรืออาจเกิดอาการ Carpal Tunnel Syndrome (CTS) ซึ่งเป็นอาการเจ็บป่วยที่เกิดจากเส้นประสาทบริเวณข้อมูลถูกกดทับเป็นเวลานาน ๆ โดยอาจเกิดจากการใช้คีย์บอร์ดหรือเมาส์ รวมทั้งอาจมีอันตรายจากรังสีออกมาจากจอคอมพิวเตอร์ด้วย ถ้าคอมพิวเตอร์ทำงานผิดพลาดในระบบที่มีความสำคัญมาก ๆ อาจเป็นอันตรายกับชีวิตมนุษย์ได้ เช่น การใช้คอมพิวเตอร์ควบคุมการจราจรทางอากาศ เป็นต้น .</font></p>
    </div>

    <div class="w3-third w3-center">
      <img src="image/15.jpg" style="width:100%" onclick="onClick(this)" class="w3-hover-opacity" alt="A microphone">
    </div>
  </div>
</div>


<div class="w3-row-padding w3-light-grey w3-padding-64 w3-container">
  <div class="w3-content">
    <div class="w3-third w3-center">
      <img src="image/16.png" style="width:100%" onclick="onClick(this)" class="w3-hover-opacity" alt="A microphone">
    </div>

    <div class="w3-twothird">
      <h1><font color="orange">2.ประเภทของเครื่องคอมพิวเตอร์</h1></font>
      <h5 class="w3-padding-32">คอมพิวเตอร์ในปัจจุบันสามารถแบ่งเป็นประเภทต่างๆ โดยใช้ความแตกต่างจากขนาดของเครื่อง ความเร็วในการประมวลผล รวมทั้งราคาเป็นหลัก คือ</h5>
      <p><font size="4" color="DarkViolet">&nbsp;ซูเปอร์คอมพิวเตอร์ (supercomputer)</font></p>&nbsp;&nbsp;&nbsp;&nbsp;เป็นคอมพิวเตอร์ที่มีขนาดใหญ่ที่สุด ทำงานได้รวดเร็วและมีประสิทธิภาพสูง แต่จะมีราคาแพงที่สุด รวมทั้งต้องอยู่ทีห้องได้รับการควบคุมอุณหภูมิ และปราศจากฝุ่นละออง ทำให้ต้องเป็นองค์กรขนาดใหญ่เท่านั้น จึงสามารถจัดหาเครื่องซูเปอร์คอมพิวเตอร์มาใช้งานได้ ผู้ใช้งานคอมพิวเตอร์สามารถใช้งานได้จำนวนหลาย ๆ คน นำมาใช้ในการคำนวณที่ซับซ้อน เช่นการคำนวณทางวิทยาศาสตร์ การบิน อุตสาหกรรมน้ำมันเป็นต้น รวมทั้งพบมากในวงการวิจัยในห้องปฎิบัติการต่างๆ ทั้งภาครัฐและเอกชน

      <p>ซูเปอร์คอมพิวเตอร์รุ่นแรกสร้างในปี ค.ศ 1960 ที่องค์กรของสหรัฐอเมริกา โดยได้รับการออกแบบให้เป็นคอมพิวเตอร์ที่ความเร็วและมีประสิทธิภาพมากที่สุด ซูเปอร์ทำงานได้อย่างรวดเร็ว เนื่องจากมีการใช้หลักทีเรียกว่า มัลติโปรเซสซิ่ง (Multiprocessing) อันเป็นใช้หน่วยประมวลผลจำนวนหลายตัว เพื่อทำให้คอมพิวเตอร์สามารถทำงานหลายงานพร้อมกัน โดยที่งานเหล่านั้นมีความแตกต่างกัน งานที่ไม่เกี่ยวข้อง หรืออาจจะเป็นงานที่มีขนาดใหญ่ที่ถูกแบ่งย่อยไปในประมวลผลแต่ละตัวก็ทำงานได้ ซูเปอร์คอมพิวเตอร์มีหน่วยประมวลกลางทั้งหมด 4 ตัว แต่ปัจจุบันคอมพิวเตอร์มีความพัฒนามากจึงทำให้มีหน่วยประมวลผลนับร้อยตัวทำงานพร้อม ๆ กัน</p>

      <p>ความเร็วของซูเปอร์คอมพิวเตอร์จะมีการวัดหน่วยเป็น นาโนวินาที (nanosecond) หรือเศษหนึ่งพันล้านวินาที และ จิกะฟลอป (gigaflop) หรือการคำนวณหนึ่งพันล้านครั้งในหนึ่งวินาทีซึ่งคอมพิวเตอร์สามารถคำนวณได้ถึง 128 จิกะฟลอป และใช้เครื่องที่มี สายส่งข้อมูล (data bus) กว้าง 32 หรือ 64 บิต</p>

      <p>จากคุณสมบัติของซูเปอร์คอมพิวเตอร์ที่กล่าวมาทั้งหมด จะเห็นได้ว่าผู้ใช้ควรนำซูเปอร์คอมพิวเตอร์ไปใช้ในการคำนวณมากๆ เช่น งานด้านกราฟฟิก หรือการคำนวณทางด้านวิทยาศาสตร์ เป็นต้น</p>

    </div>
  </div>
</div>

<div class="w3-row-padding w3-padding-64 w3-container">
  <div class="w3-content">
    <div class="w3-twothird">
      <h1><font color="orange">3.องค์ประกอบของระบบคอมพิวเตอร์</h1></font>
      <h5 class="w3-padding-32">ระบบคอมพิวเตอร์ประกอบด้วยองค์ประกอบสำคัญ 5 ส่วนด้วยกัน คือ</h5>
        <p><font size="4" color="DarkViolet">&nbsp;&nbsp;ฮาร์ดแวร์ (Hardware)</font></p>
        คือลักษณะทางกายของเครื่องคอมพิวเตอร์ ซึ่งหมายถึงตัวเครื่องคอมพิวเตอร์ และ อุปกรณ์รอบข้าง (peripheral) ที่เกี่ยวข้อง เช่น ฮาร์ดดิสก์ เครื่องพิมพ์ เป็นต้น ฮาร์ดแวร์ประกอบด้วย

        หน่วยรับข้อมูล ( input unit )
        หน่วยประมวลผลกลาง ( central processor unit ) หรือ CPU
        หน่วยความจำหลัก
        หน่วยแสดงผลลัพธ์ (output unit )
        หน่วยเก็บข้อมูลสำรอง (secondary storage unit ) 

        หน่วยรับข้อมูล จะเป็นอุปกรณ์ที่ใช้สำหรับข้อมูลต่าง ๆ เข้าสู่คอมพิวเตอร์ จากนั้น หน่วยประมวลผลกลาง จะนำไปประมวลผล และแสดงผลลัพธ์ที่ได้ออกมากให้ผู้ใช้รับทราบทาง หน่วยแสดงผลลัพธ์

        หน่วยความจำหลัก จะทำหน้าที่เสมือนเก็บข้อมูลชั่วคราวที่มีขนาดไม่สูงมากนัก การที่ฮาร์ดแวร์จะทำหน้าที่ได้มีประสิทธิภาพนั้น ขึ้นอยู่กับโปรแกรมคอมพิวเตอร์ที่ใช้ ส่วนการทำงานได้มากน้อยเพียงใด จะขึ้นอยู่กับหน่วยความจำหลักของเครื่องนั้น ๆ ข้อเสียของหน่วยความจำหลักคือ หากปิดเครื่องคอมพิวเตอร์ที่อยู่ในหน่วยความจำหลักจะหายไป ในขณะที่ข้อมูลอยู่ที่ หน่วยเก็บข้อมูลสำรอง จะไม่สูญหายตราบเท่าที่ผู้ใช้ไม่ทำการลบข้อมูลนั้น รวมทั้งหน่วยเก็ยข้อมูลสำรองยังมีความจุที่สูงมาก จึงเหมาะสำหรับการเก็บข้อมูลที่มีขนาดใหญ่ หรือเก็บข้อมูลไว้ใช้ในภายหลัง ข้อเสียของหน่วยเก็บข้อมูลสำรองคือการเรียกใช้ข้อมูลจะช้ากว่าหน่วยความจำหลักมาก
        
        <p><font size="4" color="DarkViolet">&nbsp;&nbsp;ซอฟต์แวร์ (Software)</font></p>
        คอมพิวเตอร์ฮาร์ดแวร์ที่ประกอบออกมาจากโรงงานจะยังไม่สามารถทำงานใดๆ เนื่องจากต้องมี ซอฟต์แวร์ (Software) ซึ่งเป็นชุดคำสั่งหรือโปรแกรมที่สั่งให้ฮาร์ดแวร์ทำงานต่าง ๆ ตามต้องการ โดยชุดคำสั่งหรือโปรแกรมนั้นจะเขียนขึ้นมาจาก ภาษาคอมพิวเตอร์ (Programming Language) ภาษาใดภาษาหนึ่ง และมี โปรแกรมเมอร์ (Programmer) หรือนักเขียนโปรแกรมเป็นผู้ใช้ภาษาคอมพิวเตอร์เหล่านั้นเขียนซอฟต์แวร์ต่าง ๆ ขึ้นมา

        ซอฟต์แวร์ สามารถแบ่งออกเป็นสองประเภทใหญ่ๆคือ

        ซอฟต์แวร์ระบบ (System Software )
        ซอฟต์แวร์ประยุกต์ ( Application Software )
        ซอฟต์แวร์ระบบ โดยส่วนมากแล้วจะติดตั้งมากับเครื่องคอมพิวเตอร์เนื่องจากซอฟต์แวร์ระบบเป็นส่วนควบคุมทำงานต่าง ๆ ของคอมพิวเตอร์ เพื่อให้สามารถเริ่มต้นการทำงานอื่น ๆ ที่ผู้ใช้ต้องการได้ต่อไป ส่วน ซอฟต์แวร์ประยุกต์ จะเป็นซอฟต์แวร์ที่เน้นในการช่วยการทำงานต่าง ๆ ให้กับผู้ใช้ ซึ่งแตกต่างกันไปตามความต้องการของผู้ใช้แต่ละคน</h5>
        <p><font size="4" color="DarkViolet">&nbsp;&nbsp;บุคลากร (Peopleware)</font></p>
        เครื่องคอมพิวเตอร์โดยมากต้องใช้บุคลากรสั่งให้เครื่องทำงาน เรียกบุคลากรเหล่านี้ว่า ผู้ใช้ หรือ ยูเซอร์ (user) แต่ก็มีบางชนิดที่สามารถทำงานได้เองโดยไม่ต้องใช้ผู้ควบคุม อย่างไรก็ตาม คอมพิวเตอร์ก็ยังคงต้องถูกออกแบบหรือดูแลรักษาโดยมนุษย์เสมอ

        ผู้ใช้คอมพิวเตอร์ (computer user) แบ่งได้เป็นหลายระดับ เพราะผู้ใช้คอมพิวเตอร์บางส่วนก็ทำงานพื้นฐานของคอมพิวเตอร์เท่านั้น แต่บางส่วนก็พยายามศึกษาโปรแกรมประยุกต์ในขั้นที่สูงขึ้น ทำให้มีความชำนาญในการใช้โปรแกรมประยุกต์ต่าง ๆ นิยมเรียกกลุ่มนี้ว่า เพาเวอร์ยูสเซอร์ (power user)

        ผู้เชี่ยวชาญทางด้านคอมพิวเตอร์ (computer professional) หมายถึงผู้ที่ได้ศึกษาวิชาการทางด้านคอมพิวเตอร์ ทั้งในระดับกลางและระดับสูง ผู้เชี่ยวชาญทางด้านนี้จะนำความรู้ที่ได้ศึกษามาประยุกต์และพัฒนาใช้งาน และประสิทธิภาพของระบบคอมพิวเตอร์ให้ทำงานในขั้นสูงขึ้นไปได้อีก นักเขียนโปรแกรม (programmer) ก็ถือว่าเป็นผู้เชียวชาญทางคอมพิวเตอร์เช่นกัน เพราะสามารถสร้างโปรแกรมใหม่ ๆ ได้ และเป็นเส้นทางหนึ่งที่จะนำไปสู่การเป็นผู้เชี่ยวชาญทางคอมพิวเตอร์ต่อไป</h5>
        <p><font size="4" color="DarkViolet">&nbsp;&nbsp;ข้อมูลและสารสนเทศ (Data / Information)</font></p>
        ในการทำงานต่าง ๆ จะต้องมีข้อมูลเกิดขึ้นตลอดเวลา ข้อมูลที่เกี่ยวข้องกับงานที่ถูกเก็บรวบรวมมาประมวลผล เพื่อให้ได้สารสนเทศที่เป็นประโยชน์ต่อผู้ใช้ ซึ้งในปัจจุบันมีการนำเอาระบบคอมพิวเตอร์มาเป็นข้อมูลในการดัดแปลงข้อมูลให้ได้ประสิทธิภาพโดยแตกต่างๆระหว่าง ข้อมูล และ สารสนเทศ คือ

        ข้อมูล คือ ได้จากการสำรวจจริง แต่ สารสนเทศ คือ ได้จากข้อมูลไม่ผ่านกระบวนการหนึ่งก่อน</h5>
        <p><font size="4" color="DarkViolet">&nbsp;&nbsp;กระบวนการทำงาน (Procedure)</font></p>
        กระบวนการทำงานหรือโพรซีเยอร์ หมายถึง ขั้นตอนที่ผู้ใช้จะต้องทำตาม เพื่อให้ได้งานเฉพาะอย่างจากคอมพิวเตอร์ซึ่งผู้ใช้คอมพิวเตอร์ทุกคนต้องรู้การทำงานพื้นฐานของเครื่องคอมพิวเตอร์ เพื่อที่จะสามารถใช้งานได้อย่างถูกต้อง ตัวอย่างเช่น การใช้เครื่อง ฝาก-ถอนเงินอัตโนมัติ ถ้าต้องการถอนเงินจะต้องผ่านกระบวนการต่าง ๆ ดังนี้

        จอภาพแสดงข้อความเตรียมพร้อมที่จะทำงาน
        สอดบัตร และพิมพ์รหัสผู้ใช้
        เลือกรายการ
        ใส่จำนวนเงินที่ต้องการ
        รับเงิน
        รับใบบันทึกรายการ และบัตร
        การใช้คอมพิวเตอร์ปฏิบัติงานในส่วนต่าง ๆ นั้นมักจะมีขั้นตอนที่สลับซับซ้อน และเกี่ยวข้องกับช่วงเวลาต่าง ๆ ในการปฏิบัติงานด้วย จึงต้องมีคู่มือการปฏิบัติงานที่ชัดเจน เช่น คู่มือสำหรับผู้ควบคุมเครื่อง (Operation Manual) คู่มือสำหรับผู้ใช้ (User Manual) เป็นต้น</h5>
      
    </div>
    <div class="w3-third w3-center">
      <img src="image/input_output_devices.png" style="width:150%" onclick="onClick(this)" class="w3-hover-opacity" alt="A microphone">
    </div>
  </div>
</div>

<div class="w3-row-padding w3-light-grey w3-padding-64 w3-container">
  <div class="w3-content">
    <div class="w3-third w3-center">
      <img src="image/computerhistory.jpg" style="width:100%" onclick="onClick(this)" class="w3-hover-opacity" alt="A microphone">
    </div>
     <div class="w3-twothird">
      <h1><font color="orange">4.วิวัฒนาการของคอมพิวเตอร์</h1></font>
      <p><font size="4" color="DarkViolet">&nbsp;&nbsp;จุดกำเนิดของคอมพิวเตอร์</font></p>&nbsp;&nbsp;&nbsp;&nbsp;ต้นกำเนิดของคอมพิวเตอร์อาจกล่าวได้ว่ามาจากแนวความคิดของระบบตัวเลข ซึ่งได้พัฒนาเป็นวิธีการคำนวณต่าง ๆ รวมทั้งอุปกรณ์ที่ช่วยในการคำนวณอย่างง่าย ๆ คือ" กระดานคำนวณ" และ "ลูกคิด"

      ในศตวรรษที่ 17 เครื่องคำแบบใช้เฟื่องเครื่องแรกได้กำเนิดขึ้นจากนักคณิตศาสตร์ชาวฝรั่งเศษ คือ Blaise Pascal โดยเครื่องของเขาสามารถคำนวณการบวกการลบได้อย่างเที่ยงตรง และในศตวรรษเดียวกันนักคณิตศาสตร์ชาวเยอร์มันคือ Gottried Wilhelm von Leibniz ได้สร้างเครื่องคิดเลขเครื่องแรกที่สามารถคูณและหารได้ด้วย

      ในต้นศตวรรษที่ 19 ชาวฝรั่งเศษชื่อ Joseph Marie Jacquard ได้พัฒนาเครื่องทอผ้าที่สามารถโปแกรมได้ โดยเครื่องทอผ้านี้ใช้บัตรขนาดใหญ่ ซึ่งได้เจาะรู้ไว้เพื่อควบคุมรูปแบบของลายที่จะปัก บัตรเจาะรู(punched card) ที่ Jacquard ใช้นี้ได้ถูกพัฒนาต่อๆมาโดยผู้อื่น เพื่อใช้เป็นอุปกรณ์ป้อนข้อมูลและโปรแกรมเข้าเครื่องคอมพิวเตอร์ในยุคแรกๆ

      ต่อมาในศตวรรษเดียวกัน ชาวอังกฤษชื่อ Charles Babbage ได้ทำการสร้างเครื่องสำหรับแก้สมการโดยใช้พลังงานไอน้ำ เรียกว่า difference engine และถัดจากนั้นได้เสนอทฤษฎีเกี่ยวกับ คอมพิวเตอร์สมัยใหม่ เมื่อเขาได้ทำการออกแบบ เครื่องจักรสำหรับทำการวิเคราะห์ (analytical engine) โดยใช้พลังงานจากไอน้ำ ซึ่งได้มีการออกแบบให้ใช้บัตรเจาะรูของ Jacquard ในการป้อนข้อมูล ทำให้อุปกรณ์ชิ้นนี้มีหน่วยรับข้อมูล หน่วยประมวลผล หน่วยแสดงผล และหน่วยเก็บข้อมูลสำรอง ครบตามรูปแบบของคอมพิวเตอร์สมัยใหม่ แต่โชคไม่ดีที่แม้ว่าแนวความคิดของเขวจะถูกต้อง แต่เทคโนโลยีในขณะนั้นไม่เอื้ออำนวยต่อการสร้างเครื่องที่สามารถทำงานได้จริง อย่างไรก็ดี Charles Babbage ก็ได้รับการยกย่องว่าเป็นบิดาของคอมพิวเตอร์คนแรก และผู้ร่วมงานของเขาคือ Augusta Ada Byron ก็ได้รับการยกย่องว่าเป็นนักเขียนโปรแกรมคนแรกของโลก

      

    </div>
  </div>
</div>
</div>
<?php include("footer.php"); ?>
