<?php include("header.php"); ?>
<div class="w3-content w3-padding" style="max-width:1564px">
<div class="w3-row-padding w3-padding-64 w3-container">
  <div class="w3-content">
    <div>
      <h1><font color="red">พ.ร.บ.คอมพิวเตอร์ฯ 2560</h1></font>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;พ.ร.บ.ว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ (ฉบับที่ 2) พ.ศ.2560หรือที่คุ้นหูในชื่อ พ.ร.บ.คอมพิวเตอร์ฯ ผ่านการพิจารณาของสภานิติบัญญัติแห่งชาติ (สนช.) เมื่อวันที่ 16 ธันวาคม 2559 ประกาศลงราชกิจจานุเบกษาเมื่อวันที่ 24 มกราคม 2560 และมีผลบังคับใช้เมื่อวันที่ 24 พฤษภาคม 2560 หากจำกันได้สำหรับ พ.ร.บ.คอมพิวเตอร์ฯ ฉบับนี้ เคยถูกคัดค้านอย่างหนัก ก่อนการพิจารณาในวาระที่ 2 และ 3 ในที่ประชุมของ สนช. ช่วงปลายปี 2559 โดยมีผู้ร่วมลงชื่อกว่า 300,000 คนในเว็บไซต์ change.org เรียกร้องให้สนช.ชะลอการพิจารณากฎหมายดังกล่าว
 
	  <p>กฎหมายดังกล่าวเป็นการแก้ไขกฎหมายเดิมอย่าง พ.ร.บ.คอมพิวเตอร์ฯ ปี 2550 โดยหนึ่งในประเด็นที่มีการแก้ไขใหม่ คือ การแก้ไขมาตรา 14 เพื่อป้องกันการนำมาใช้ฟ้องหมิ่นประมาท เนื่องจากในอดีต มาตราดังกล่าวนำมาสู่การฟ้องร้องดำเนินคดีเอาผิดกับ "เนื้อหา" บนโลกออนไลน์ ทั้งที่เจตนารมณ์ของกฎหมายมีขึ้นเพื่อการเอาผิดการกระทำต่อ "ระบบ" คอมพิวเตอร์</p>
		 
	  <p>อย่างไรก็ดี ภายหลังการแก้ไขกฎหมายของ สนช. พ.ร.บ.คอมพิวเตอร์ฯ ยังถูกนำมาใช้เป็นเครื่องมือสำหรับการจำกัดการใช้เสรีภาพการแสดงความคิดเห็นบนโลกออนไลน์เหมือนเดิม โดยเฉพาะกลุ่มคนที่ออกมาวิพากษ์วิจารณ์การทำงานของรัฐบาล</p></font></p>

	  <h2><font color="red">สนช. แก้ พ.ร.บ.คอมฯ ใหม่ ตัดปัญหาฟ้องหมิ่นประมาท แต่เพิ่มข้อหาใหม่</h2></font>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;สำหรับบทบัญญัติใหม่ของมาตรา 14 พ.ร.บ.คอมพิวเตอร์ฯ ปี 2560 มีดังนี้
 
	  <p>มาตรา 14 ผู้ใดกระทําความผิดที่ระบุไว้ดังต่อไปนี้ ต้องระวางโทษจําคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจําทั้งปรับ</p>
		 
	  <p>(1) โดยทุจริต หรือโดยหลอกลวง นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ที่บิดเบือนหรือปลอมไม่ว่าทั้งหมดหรือบางส่วน หรือข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายแก่ประชาชน อันมิใช่การกระทําความผิดฐานหมิ่นประมาทตามประมวลกฎหมายอาญา</p>

	  <p>(2) นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายต่อการรักษาความมั่นคงปลอดภัยของประเทศ ความปลอดภัยสาธารณะ ความมั่นคงในทางเศรษฐกิจของประเทศ หรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะของประเทศ หรือก่อให้เกิดความตื่นตระหนกแก่ประชาชน</p>

	  <p>(3) นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ อันเป็นความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักรหรือความผิดเกี่ยวกับการก่อการร้ายตามประมวลกฎหมายอาญา</p>

	  <p>(4) นําเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ ที่มีลักษณะอันลามกและข้อมูลคอมพิวเตอร์นั้นประชาชนทั่วไปอาจเข้าถึงได</p>

	  <p>(5) เผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์โดยรู้อยู่แล้วว่าเป็นข้อมูลคอมพิวเตอร์ตาม (1) (2) (3) หรือ (4)</p>

	 <p>ถ้าการกระทําความผิดตามวรรคหนึ่ง (1) มิได้กระทําต่อประชาชน แต่เป็นการกระทําต่อบุคคลใดบุคคลหนึ่ง ผู้กระทํา ผู้เผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์ดังกล่าวต้องระวางโทษจําคุกไม่เกินสามปีหรือปรับไม่เกินหกหมื่นบาท หรือทั้งจําทั้งปรับ และให้เป็นความผิดอันยอมความได้</p></font></p>

	 <h2><font color="red">โดยรายละเอียดการแก้ไขในมาตรา 14 พ.ร.บ.คอมพิวเตอร์ฯ ได้แก่</h2></font>
      <p><font size="4">หนึ่ง การเพิ่มคำว่า “ที่บิดเบือน” เข้าไปเป็นส่วนหนึ่งของข้อมูลคอมพิวเตอร์ที่นำเข้าสู่ระบบอันเป็นความผิด
 
 
	  <p>สอง การเพิ่มคำว่า “โดยทุจริต หรือ โดยหลอกลวง” เข้ามาเป็นองค์ประกอบความผิดตามมาตรา 14 (1) ด้วย ซึ่งคำว่า "โดยทุจริต" มีคำนิยามอยู่ในมาตรา 2 ของประมวลกฎหมายอาญา หมายความว่า เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น</p>
		 
	  <p>สาม การเพิ่มวรรคสอง โดยกำหนดให้การกระทำความผิดมาตรา 14(1) ที่มีผู้เสียหายเป็นบุคคลใดบุคคลหนึ่ง ไม่ได้จงใจหลอกลวงประชาชนทั่วไป “เป็นความผิดอันยอมความได้”</p>

	  <p>สี่ การเพิ่มวรรคสอง โดยกำหนดให้การกระทำความผิดมาตรา 14(1) ที่มีผู้เสียหายเป็นบุคคลใดบุคคลหนึ่ง ไม่ได้จงใจหลอกลวงประชาชนทั่วไป ให้มีอัตราโทษลดลง คือ จำคุกไม่เกินสามปี หรือปรับไม่เกิน 60,000 บาท</p>

	  <p>ห้า การเพิ่มคำว่า “ความปลอดภัยสาธารณะ” “ความมั่นคงทางเศรษฐกิจ” และ “โครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะของประเทศ” เป็นองค์ประกอบความผิดฐานนำเข้าข้อมูลเท็จเข้าสู่ระบบตามมาตรา 14 (2)</p></font></p>



		</div>
	</div>
</div>
</div>
<?php include("footer.php"); ?>