<?php include("header.php"); ?>
<div class="w3-content w3-padding" style="max-width:1564px">
<div class="w3-row-padding w3-padding-64 w3-container">
  <div class="w3-content">
    <div>
      <h1><font color="green">1.จริยธรรมในการใช้เทคโนโลยีสารสนเทศ</h1></font>
      <p><font size="4">จริยธรรม หมายถึง "หลักศีลธรรมจรรยาที่กำหนดขึ้นเพื่อใช้เป็นแนวทางปฏิบัติ หรือควบคุมการใช้ระบบคอมพิวเตอร์และสารสนเทศ" </font></p>

         <p><font size="4">ในทางปฏิบัติแล้ว การระบุว่าการกระทำสิ่งใดผิดจริยธรรมนั้น อาจกล่าวได้ไม่ชัดเจนมากนัก ทั้งนี้ ย่อมขึ้นอยู่กับวัฒนธรรมของสังคมในแต่ละประเทศด้วย อย่างเช่น กรณีที่เจ้าของบริษัทใช้กล้องในการตรวจจับหรือเฝ้าดูการทำงานของพนักงาน เป็นต้น ตัวอย่างของการกระทำที่ยอมรับกันโดยทั่วไปว่าเป็นการกระทำที่ผิดจริยธรรม เช่นการใช้คอมพิวเตอร์ทำร้ายผู้อื่นให้เกิดความเสียหายหรือก่อความรำราญ เช่น การนำภาพหรือข้อมูลส่วนตัวของบุคคลไปลงบนอินเตอร์เน็ตโดยไม่ได้รับอนุญาตการใช้คอมพิวเตอร์ในการขโมยข้อมูลการเข้าถึงข้อมูลหรือคอมพิวเตอร์ของบุคคลอื่นโดยไม่ได้รับอนุญาตการละเมิดลิขสิทธิ์ โดยทั่วไป เมื่อพิจารณาถึงจริยธรรมเกี่ยวกับการใช้เทคโนโลยีคอมพิวเตอร์และสารสนเทศแล้ว จะกล่าวถึงใน 4ประเด็น ที่รู้จักกันในลักษณะตัวย่อว่า PAPA ประกอบด้วย

          1. ความเป็นส่วนตัว (Information Privacy) 
          2. ความถูกต้อง (Information Accuracy) 
          3 ความเป็นเจ้าของ (Information Property) 
          4. การเข้าถึงข้อมูล (Data Accessibility)</font></p>
          <p><font size="4">1. ความเป็นส่วนตัว (Information Privacy)</font></p>
          <p><font size="4">ความเป็นส่วนตัวของข้อมูลและสารสนเทศ โดยทั่วไปหมายถึง สิทธิที่จะอยู่ตามลำพัง และเป็นสิทธิที่เจ้าของสามารถที่จะควบคุมข้อมูลของตนเองในการเปิดเผยให้กับผู้อื่น สิทธินี้ใช้ได้ครอบคลุมทั้งปัจเจกบุคคล กลุ่มบุคคล และองค์การต่างๆปัจจุบันมีประเด็นเกี่ยวกับความเป็นส่วนตัวที่เป็นข้อหน้าสังเกตดังนี้

          <p>1.การเข้าไปดูข้อความในจดหมายอิเล็กทรอนิกส์และการบันทึกข้อมูลในเครื่องคอมพิวเตอร์ รวมทั้งการบันทึก-แลกเปลี่ยนข้อมูลที่บุคคลเข้าไปใช้บริการเว็บไซต์และกลุ่มข่าวสาร</p>

          <p>2.การใช้เทคโนโลยีในการติดตามความเคลื่อนไหวหรือพฤติกรรมของบุคคล เช่น บริษัทใช้คอมพิวเตอร์ในการตรวจจับหรือเฝ้าดูการปฏิบัติงาน/การใช้บริการของพนักงาน ถึงแม้ว่าจะเป็นการติดตามการทำงานเพื่อการพัฒนาคุณภาพการใช้บริการ แต่กิจกรรมหลายอย่างของพนักงานก็ถูกเฝ้าดูด้วย พนักงานสูญเสียความเป็นส่วนตัว ซึ่งการกระทำเช่นนี้ถือเป็นการผิดจริยธรรม</p>

          <p>3.การใช้ข้อมูลของลูกค้าจากแหล่งต่างๆ เพื่อผลประโยชน์ในการขยายตลาด</p>

          <p>4.การรวบรวมหมายเลขโทรศัพท์ ที่อยู่อีเมล์ หมายเลขบัตรเครดิต และข้อมูลส่วนตัวอื่นๆ เพื่อนำไปสร้างฐานข้อมูลประวัติลูกค้าขึ้นมาใหม่ แล้วนำไปขายให้กับบริษัทอื่น ดังนั้น เพื่อเป็นการป้องกันการละเมิดสิทธิความเป็นส่วนตัวของข้อมูลและสารสนเทศ จึงควรจะต้องระวังการให้ข้อมูล โดยเฉพาะการใช้อินเตอร์เน็ตที่มีการใช้โปรโมชั่น หรือระบุให้มีการลงทะเบียนก่อนเข้าใช้บริการ เช่น ข้อมูลบัตรเครดิต และที่อยู่อีเมล์</p>

          <p><font size="4" >2. ความถูกต้อง (Information Accuracy)</font></p>
          <p><font size="4"> ในการใช้คอมพิวเตอร์เพื่อการรวบรวม จัดเก็บ และเรียกใช้ข้อมูลนั้น คุณลักษณะที่สำคัญประการหนึ่ง คือ ความน่าเชื่อถือได้ของข้อมูล ทั้งนี้ ข้อมูลจะมีความน่าเชื่อถือมากน้อยเพียงใดย่อมขึ้นอยู่กับความถูกต้องในการบันทึกข้อมูลด้วย ประเด็นด้านจริยธรรมที่เกี่ยวข้องกับความถูกต้องของข้อมูล โดยทั่วไปจะพิจารณาว่าใครจะเป็นผู้รับผิดชอบต่อความถูกต้องของข้อมูลที่จัดเก็บและเผยแพร่ เช่น ในกรณีที่องค์การให้ลูกค้าลงทะเบียนด้วยตนเอง หรือกรณีของข้อมูลที่เผยแพร่ผ่านทางเว็บไซต์ อีกประเด็นหนึ่ง คือ จะทราบได้อย่างไรว่าข้อผิดพลาดที่เกิดขึ้นนั้นไม่ได้เกิดจากความจงใจ และผู้ใดจะเป็นผู้รับผิดชอบหากเกิดข้อผิดพลาด

          ดังนั้น ในการจัดทำข้อมูลและสารสนเทศให้มีความถูกต้องและน่าเชื่อถือนั้น ข้อมูลควรได้รับการตรวจสอบความถูกต้องก่อนที่จะนำเข้าฐานข้อมูล รวมถึงการปรับปรุงข้อมูลให้มีความทันสมัยอยู่เสมอ นอกจากนี้ ควรให้สิทธิแก่บุคคลในการเข้าไปตรวจสอบความถูกต้องของข้อมูลของตนเองได้ เช่น ผู้สอนสามารถดูคะแนนของนักศึกษาในความรับผิดชอบ หรือที่สอนเพื่อตรวจสอบว่าคะแนนที่ป้อนไม่ถูกแก้ไขเปลี่ยนแปลง</font></p>

          <p><font size="4">3.ความเป็นเจ้าของ (Information Property)</font></p>
          <p><font size="4">สิทธิความเป็นเจ้าของ หมายถึง กรรมสิทธิ์ในการถือครองทรัพย์สิน ซึ่งอาจเป็นทรัพย์สินทั่วไปที่จับต้องได้ เช่น คอมพิวเตอร์ รถยนต์ หรืออาจเป็นทรัพย์สินทางปัญญา (ความคิด) ที่จับต้องไม่ได้ เช่น บทเพลง โปรแกรมคอมพิวเตอร์ แต่สามารถถ่ายทอดและบันทึกลงในสื่อต่างๆ ได้ เช่น สิ่งพิมพ์ เทป ซีดีรอม เป็นต้น

          ในสังคมของเทคโนโลยีสารสนเทศ มักจะกล่าวถึงการละเมิดลิขสิทธิ์ซอฟต์แวร์ เมื่อท่านซื้อโปรแกรมคอมพิวเตอร์ที่มีการจดลิขสิทธิ์ นั่นหมายความว่าท่านได้จ่ายค่าลิขสิทธิ์ในการใช้ซอฟต์แวร์นั้น สำหรับท่านเองหลังจากที่ท่านเปิดกล่องหรือบรรจุภัณฑ์แล้ว หมายถึงว่าท่านได้ยอมรับข้อตกลงเกี่ยวกับลิขสิทธิ์ในการใช้สินค้านั้น ซึ่งลิขสิทธิ์ในการใช้จะแตกต่างกันไปในแต่ละสินค้าและบริษัท บางโปรแกรมคอมพิวเตอร์จะอนุญาตให้ติดตั้งได้เพียงครั้งเดียว หรือไม่อนุญาตให้ใช้กับคอมพิวเตอร์เครื่องอื่นๆ ถึงแม้ว่าคอมพิวเตอร์เครื่องนั้นๆ ท่านเป็นเจ้าของ และไม่มีผู้อื่นใช้ก็ตาม ในขณะที่บางบริษัทอนุญาตให้ใช้โปรแกรมนั้นได้หลายๆ เครื่อง ตราบใดที่ท่านยังเป็นบุคคลที่มีสิทธิในโปรแกรมคอมพิวเตอร์ที่ซื้อมา การคัดลอกโปรแกรมคอมพิวเตอร์ให้กับเพื่อน เป็นการกระทำที่จะต้องพิจารณาให้รอบคอบก่อนว่าโปรแกรมที่จะทำการคัดลอกนั้น เป็นโปรแกรมคอมพิวเตอร์ที่ท่านมีสิทธ์ในระดับใด</font></p>
          <p><font size="4" >4.การเข้าถึงข้อมูล (Data Accessibility)</font></p>
          <p><font size="4">  ปัจจุบันการเข้าใช้งานโปรแกรม หรือระบบคอมพิวเตอร์มักจะมีการกำหนดสิทธิตามระดับของผู้ใช้งาน ทั้งนี้ เพื่อเป็นการป้องกันการเข้าไปดำเนินการต่างๆ กับข้อมูลของผู้ใช้ที่ไม่มีส่วนเกี่ยวข้อง และเป็นการรักษาความลับของข้อมูล ตัวอย่างสิทธิในการใช้งานระบบ เช่น การบันทึก การแก้ไข/ปรับปรุง และการลบ เป็นต้น ดังนั้น ในการพัฒนาระบบคอมพิวเตอร์จึงได้มีการออกแบบระบบรักษาความปลอดภัยในการเข้าถึงของผู้ใช้ และการเข้าถึงข้อมูลของผู้อื่นโดยไม่ได้รับความยินยอมนั้น ก็ถือเป็นการผิดจริยธรรมเช่นเดียวกับการละเมิดข้อมูลส่วนตัว ในการใช้งานคอมพิวเตอร์และเครือข่ายร่วมกันให้เป็นระเบียบ หากผู้ใช้ร่วมใจกันปฏิบัติตามระเบียบและข้อบังคับของแต่ละหน่วยงานอย่างเคร่งครัดแล้ว การผิดจริยธรรมตามประเด็นดังที่กล่าวมาข้างต้นก็คงจะไม่เกิดขึ้น</font></p>
          <h1><font color="green">2.จริยธรรมในการใช้เทคโนโลยีสารสนเทศร่วมกัน</h1></font>
          <p><font size="4">ผู้ใช้อินเทอร์เน็ตมีเป็นจำนวนมากและเพิ่มขึ้นทุกวัน การใช้งานระบบเครือข่ายที่ออนไลน์และส่งข่าวสารถึงกันย่อมมีผู้ที่มีความประพฤติไม่ดีปะปนและสร้างปัญหาให้กับผู้ใช้อื่นอยู่เสมอ หลายเครือข่ายจึงได้ออกกฏเกณฑ์การใช้งานภายในเครือข่าย เพื่อให้สมาชิกในเครือข่ายของตนยึดถือ ปฏิบัติตามกฏเกณฑ์และได้รับประโยชน์สูงสุด

          ดังนั้น ผู้ใช้อินเทอร์เน็ตทุกคนที่เป็นสมาชิกเครือข่ายจะต้องเข้าใจกฏเกณฑ์ข้อบังคับของ เครือข่ายนั้นมีความรับผิดชอบต่อตนเองและผู้ร่วมใช้บริการคนอื่นและจะต้องรับผิดชอบต่อการกระทำของตนเองที่เข้าไปขอใช้บริการต่างๆ บนเครือข่ายบนระบบคอมพิวเตอร์

          เครือข่ายคอมพิวเตอร์ที่ผู้ใช้อินเทอร์เน็ตเรียกเข้ามิได้เป็นเพียงเครือข่ายขององค์กรที่ผู้ใช้สังกัด แต่เป็นการเชื่อมโยงของเครือข่ายต่างๆ เข้าหากันหลายพันหลายหมื่นเครือข่ายมีข้อมูลข่าวสารอยู่ระหว่างเครือข่ายเป็นจำนวนมาก การส่งข่าวสารในเครือข่ายนั้นอาจทำให้ข่าวสารกระจายเดินทางไปยังเครือข่ายอื่น ๆ อีกเป็นจำนวนมากหรือแม้แต่การส่งไปรษณีย์อิเล็กทรอนิกส์ฉบับหนึ่งก็อาจจะต้องเดินทางผ่านเครือข่ายอีกหลายเครือข่ายกว่าจะถึงปลายทาง ดังนั้นผู้ใช้บริการต้องให้ความสำคัญและตระหนักถึงปัญหาปริมาณข้อมูลข่าวสารที่วิ่งอยู่บนเครือข่าย
             
          การใช้งานอย่างสร้างสรรค์และเกิดประโยชน์จะทำให้สังคมอินเทอร์เน็ตน่าใช้และเป็นประโยชน์ร่วมกันอย่างดี กิจกรรมบางอย่างที่ไม่ควรปฏิบัติจะต้องหลีกเลี่ยงเช่นการส่งกระจายข่าวไปเป็นจำนวนมากบนเครือข่าย การส่งเอกสารจดหมายลูกโซ่ ฯลฯ สิ่งเหล่านี้จะเป็นผลเสียโดยรวมต่อผู้ใช้และไม่เกิดประโยชน์ใด ๆ ต่อสังคมอินเทอร์เน็ต

          เพื่อให้การอยู่ร่วมกันในสังคมอินเทอร์เน็ตสงบสุข Arlene H.Rinaldi แห่งมหาวิทยาลัย ฟอร์ริดาแอตแลนติก จึงรวบรวมกฎกติกามารยาทและวางเป็นจรรยาบรรณอินเทอร์เน็ตหรือที่เรียกว่า Netiquette ไว้ดังนี้

          <p><font size="4" >จรรยาบรรณสำหรับผู้ใช้ไปรษณีย์อิเล็กทรอนิกส์(E-mail)</font></p>
          <p><font size="4">ผู้ใช้อินเทอร์เน็ตทุกคนมีเมล์บ็อกซ์หรืออีเมล์แอดเดรสที่ใช้อ้างอิงในการรับส่ง จดหมาย ความรับผิดชอบต่อการใช้งานอีเมล์ในระบบจึงเป็นเรื่องที่ทุกคนต้องให้ความสำคัญ เพราะจดหมายมีการรับส่งโดยระบบ ซึ่งหากมีจดหมายค้างในระบบจำนวนมากจะทำให้พื้นที่ บัฟเฟอร์ของจดหมายในระบบหมด จะเป็นผลให้ระบบไม่สามารถรับส่งจดหมายต่อไปได้ หลายต่อหลายครั้งระบบปฏิเสธการรับส่งจดหมายเพราะไฟล์ระบบเต็ม ดังนั้นจึงควรมีความรับผิดชอบในการดูแลตู้จดหมาย (mail box) ของตนเองดังนี้

          1. ตรวจสอบจดหมายทุกวันและจะต้องจำกัดจำนวนไฟล์และข้อมูลในตู้จดหมายของตนให้เลือกภายในโควต้า ที่กำหนด

          2. ลบข้อความหรือจดหมายที่ไม่ต้องการแล้วออกจากดิสต์เพื่อลดปริมาณการใช้ดิสก็ให้จำนวนจดหมายที่อยู่ในตู้จดหมาย (mail box) มีจำนวนน้อยที่สุด

          3. ให้ทำการโอนย้ายจดหมายจากระบบไปไว้ยังพีซีหรือฮาร์ดดิสก์ของตนเองเพื่อใช้อ้างอิงในภายหลัง

          พึงระลึกเสมอว่าจดหมายที่เก็บไว้ในตู้จดหมายนี้อาจถูกผู้อื่นแอบอ่านได้ ไม่ควรเก็บข้อมูลหรือจดหมายที่คุณคิดว่าไม่ใช้แล้วเสมือนเป็นประกาศไว้ในตู้จดหมาย</font></p>

          <p><font size="4">จรรยาบรรณสำหรับผู้สนทนา(Chat)</font></p>
          <p><font size="4">บนเครือข่ายอินเทอร์เน็ตมีคำสั่งให้ใช้ในการโต้ตอบกันอย่างออนไลน์หลายคำสั่งเช่น write, talk หรือมีการสนทนา เป็นกลุ่มเช่น IRC เป็นต้น ในการเรียกหาหรือเปิดการสนทนาตลอดจนการสนทนาจะต้องมีมารยาทที่สำคัญได้แก่</font></p>

          <p><font size="4">1.ควรเรียกสนทนาจากผู้ที่เรารู้จักและต้องการสนทนาด้วย หรือมีเรื่องสำคัญที่จะติดต่อด้วย ควรระลึกเสมอว่าการขัดจังหวะผู้อื่นที่กำลังทำงานอยู่อาจสร้างปัญหาให้ได้

          <p>2.ก่อนการเรียกคู่สนทนาควรสอบสถานะการใช้งานของคู่สนทนาที่ต้องการเรียกเพราะการเรียกแต่ละครั้งจะมีข้อความไปปรากฏบนจอภาพของฝ่ายถูกเรียกซึ่งก็สร้างปัญหาการทำงานได้ เช่น ขณะกำลังทำงานค้าง ftp ซึ่งไม่สามารถหยุดได้</p>

          <p>3.หลังจากเรียกไปชั่วขณะคู่ที่ถูกเรียกไม่ตอบกลับ แสดงว่าคู่สนทนาอาจติดงานสำคัญ ขอให้หยุดการเรียกเพราะข้อความที่เรียกไปปรากฏบนจออย่างแน่นอนแล้ว</p>

          <p>4.ควรให้วาจาสุภาพ และให้เกียรติซึ่งกันและกัน การแทรกอารมณ์ขัน ควรกระทำกับคนที่รู้จักคุ้นเคยแล้วเท่านั้น</p></font></p>

          <p><font size="4">จรรยาบรรณสำหรับผู้ใช้กระดานข่าว ระบบสื่อสารอิเล็กทรอนิกส์</font></p>
          <p><font size="4">ระบบข่าวสารที่ให้บริการในสังคมอินเทอร์เน็ตมีหลายระบบ เช่น ยูสเน็ตนิสว์ (UseNet News) ระบบสมาชิกแจ้งข่าวหลายสมาคม บอกรับสมาชิกและให้ข่าวสารที่สม่ำเสมอกับสมาชิกด้วยการส่งเป็นจดหมายอิเล็กทรอนิกส์ ที่เรียกว่า Mailing lists ผู้เสนอ ข่าวและผู้อภิปรายเรื่อง ต่าง ๆ ที่เขียนลงไปจะกระจายออกไปทั่วโลก เช่นข่าวบนยูสเน็ตนิวส์แต่ละกลุ่มเมื่อส่งออกจะกระจาย ไปยังเซิร์ฟเวอร์อื่น ๆ ทั่วโลก ผู้ใช้บริการโดยเฉพาะที่ต้องการเขียนข่าวสารบนกระดาษ ข่าวจะต้องเคารพกฏกติกามารยาทโดยเคร่งครัดข้อปฏิบัติที่สำคัญได้แก่

          <p>1. ให้เขียนเรื่องให้กระชับ ข้อความควรสั้นและตรงประเด็กไม่กำกวม ใช้ภาษาที่เรียบงาน สุภาพเข้าใจได้

          ในแต่ละเรื่องที่เขียนให้ตรงโดยข้อความที่เขียนควรจะมีหัวข้อเดียวต่อเรื่อง</p>

          <p>2. ในการเขียนพาดพิงถึงผู้อื่น ให้ระมัดระวังในการละเมิดหรือสร้างความเสียหายให้ผู้อื่น การให้อีเมล์อาจตรงประเด็นกว่า</p>

          <p>3. ให้แหล่งที่มาของข้อความ ควรอ้างอิงแหล่งข่าวได้ ไม่เรียกว่าโคมลอยหรือข่าวลือหรือเขียนข่าวเพื่อความสนุกโดยขาดความรับผิดชอบ</p>

          <p>4. จำกัดความยาวของข่าว และหลีกเลี่ยงตัวอักษรควบคุมพิเศษอื่น ๆ เพราะหลายเครื่องที่อ่านข่าวอาจมีปัญหาในการแสดงผล</p>

          <p>5. ข่าวบางข่าวมีการกระจายกันมาเป็นลำดับให้ และอ้างอิงต่อ ๆ กันมาการเขียนข่าวจึงควรพิจารณาในประเด็นนี้ด้วย โดยเฉพาะอย่าส่งจดหมายตอบโต้ไปยังผู้รายงานข่าวผู้แรก</p>

          <p>4. ไม่ควรให้เครือข่ายของมหาวิทยาลัยเพื่อประโยชน์ทางการค้าหรืองานเฉพาะของตนเพื่อประโยชน์ส่วนตนในเรื่อง การค้า</p>

          <p>5. การเขียนข่าวทุกครั้งจะต้องลงชื่อ และลายเซ็นตอนล่างของข้อความเพื่อบอกชื่อ ตำแหน่งแอดเดรสที่อ้างอิงได้ทางอินเทอร์เน็ต หรือให้ที่อยู่และหมายเลขโทรศัพท์ที่ติดต่อได้</p>

          <p>6. ในการทดสอบการส่งไม่ควรทำพร่ำเพื่อการทดสอบควรกระทำในกลุ่มข่าวท้องถิ่นที่เปิดให้ทดสอบการส่งข่าวอยู่แล้ว เพราะการส่งข่าวแต่ละครั้งจะกระจายไปทั่วโลก</p>

          <p>7. หลีกเลี่ยงการใช้ตัวอักษรใหญ่ตัวอักษรใหญ่ที่มีความหมายถึงการตะโกนหรือการแสดงความไม่พอใจใน </p> 
         
          <p>8. การเน้น คำให้ใช้เครื่องหมาย * ข้อความ* แทน</p>

          <p>9. ไม่ควรนำข้อความที่ผู้อื่นเขียนไปกระจายต่อโดยไม่ได้รับอนุญาตจากเจ้าของเรื่อง</p>
 
          <p>10. ไม่ควรใช้ข้อความตลกขบขันหรือคำเฉพาะคำกำกวม หรือคำหยาบคายในการเขียนข่าว</p>

          <p>11. ให้ความสำคัญในเรื่องลิขสิทธิ์ไม่ควรละเมิดลิขสิทธิ์ผู้อื่น</p>

          <p>12. ไม่ควรคัดลอกข่าวจากที่อื่นเช่น จากหนังสือพิมพ์ทั้งหมดโดยไม่มีการสรุปย่อและเมื่อส่งข่าวย่อจะต้องอ้างอิงที่มา</p>

          <p>13. ไม่ควรใช้กระดานข่าวเป็นที่ตอบโต้หรือละเมิดผู้อื่น</p>

          <p>14. เมื่อต้องการใช้คำย่อ คำย่อที่เป็นที่รู้จักกันทั่วไป เช่น</p>

                   <p>IMHO-in my humble / honest opinion</p>
                   <p>FYI-for your information</p>
                   <p>BTW-by the way</p>


          <p>15. การเขียนข้อความจะต้องไม่ใช้อารมณ์หรือความรู้สึกส่วนตัวและระลึกเสมอว่าข่าวที่เขียนหรือ </p>
          <p>16. อภิปรายนี้กระจายไปทั่วโลก และมีผู้อ่านข่าวจำนวนมากในการเขียนคำถามลงในกลุ่มข่าวจะต้องส่งลงในกลุ่มที่ตรงกับปัญหาที่เขียนนั้น และเมื่อจะตอบก็ต้องให้ตรงประเด็น</p>
          <p>17. ในการบอกรับข่าวด้วย mailing list และมีข่าวเข้ามาจำนวนมากทางอีเมล์จะต้องอ่านข่าว และโอนมาไว้ที่เครื่องตน (พีซี) หรือลบออกจาก mail box และหากไม่อยู่หรือไม่ได้เปิดตู้จดหมายเกินกว่าหนึ่งสัปดาห์จะต้องส่งไปบอกยกเลิกการรับ เพื่อว่าจะได้ไม่มีจดหมายส่งเข้ามามาก</font></p>

          <p><font size="4"color="green">บัญญัติ 10 ประการ</font></p></font>
          <p><font size="4">ต่อไปนี้เป็นจรรยาบรรณที่ผู้ใช้อินเทอร์เน็ตยึดถือไว้เสมือนเป็นแม่บทแห่งการปฏิบัติเพื่อระลึกและเตือนความจำเสมอ</font></p>
          <p><font size="4"> 1. ไม่ใช้คอมพิวเตอร์ทำร้ายหรือละเมิดผู้อื่น&nbsp;&nbsp;&nbsp;

          2. ต้องไม่รบกวนการทำงานของผู้อื่น&nbsp;&nbsp;&nbsp;

          3. ต้องไม่สอดแนมหรือแก้ไขเปิดดูในแฟ้มของผู้อื่น&nbsp;&nbsp;&nbsp;

          4. ต้องไม่ใช้คอมพิวเตอร์เพื่อการโจรกรรมข้อมูลข่าวสาร&nbsp;&nbsp;&nbsp;

          5. ต้องไม่ใช้คอมพิวเตอร์สร้างหลักฐานที่เป็นเท็จ&nbsp;&nbsp;&nbsp;

          6. ต้องไม่คัดลอกโปรแกรมผู้อื่นที่มีลิขสิทธิ์&nbsp;&nbsp;&nbsp;

          7. ต้องไม่ละเมิดการใช้ทรัพยากรคอมพิวเตอร์โดยที่ตนเองไม่มีสิทธิ์&nbsp;&nbsp;&nbsp;

          8. ต้องไม่นำเอาผลงานของผู้อื่นมาเป็นของตน&nbsp;&nbsp;&nbsp;

          9. ต้องคำนึงถึงสิ่งที่จะเกิดขึ้นกับสังคมอันติดตามมาจากการกระทำ&nbsp;&nbsp;&nbsp;

          10. ต้องใช้คอมพิวเตอร์โดยเคารพกฎระเบียบ กติกามารยาท</font></p>
    </div>
  </div>
</div>
</div>

<?php include("footer.php"); ?>