<?php include("header.php"); ?>
<div class="w3-content w3-padding" style="max-width:1564px">
<div class="w3-row-padding w3-padding-64 w3-container">
  <div class="w3-content">
    <div>
      <h1><font color="teal">1.พื้นฐานเครือข่ายคอมพิวเตอร์</h1></font>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;จุดประสงค์ของการประดิษฐ์คอมพิวเตอร์ใช้ในสมัยแรก ๆ นั้น เพื่อให้คอมพิวเตอร์ได้ทำงานบางอย่างแทนมนุษย์ได้  เช่น การคำนวณเลข  ซึ่งถ้าเป็นตัวเลขจำนวนมาก ๆ   มนุษย์จะใช้เวลาในการคำนวณมากและมีโอกาสเกิดข้อผิดพลาดได้มาก ในขณะที่คอมพิวเตอร์สามารถคำนวณได้เร็วกว่ามาก  อีกทั้งยังมีความแม่นยำและมีความผิดพลาดน้อยกว่ามนุษย์มาก  การทำงานจะให้มีประสิทธิภาพสูงจะ ต้องทำเป็นหมู่คณะ  หรือทีมเวิร์ค  (Teamwork)  คอมพิวเตอร์ก็ซึ่งถูกสร้างมาเพื่อทำงานแทนมนุษย์ก็จำเป็นที่ต้องมีการสื่อสารซึ่งกันและกันเช่นกัน   ฉะนั้นคอมพิวเตอร์เครื่องใดที่ไม่ได้เชื่อมต่อเข้ากับเครื่องอื่นก็เปรียบเสมือนคนที่ชอบความสันโดษ ในการเชื่อมต่อกันเป็นเครือข่ายนั้น  เป็นสาเหตุที่เนื่องมาจากการที่ผู้ใช้ต้องการทำงานเป็นกลุ่มหรือทีม ซึ่งการทำงานแบบนี้ย่อมมีประสิทธิภาพมากกว่าการทำงานแบบเดี่ยว ๆ</font></p>

      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หลังจากที่คอมพิวเตอร์ได้คิดค้นขึ้นมาแล้วนั้น ก็ยังได้มีการพัฒนามาอย่างต่อเนื่องและรวดเร็วจน ในปัจจุบันเป็นที่ยอมรับมากว่า อุตสาหกรรมคอมพิวเตอร์เป็นอุตสาหกรรมที่มีการพัฒนารวดเร็วอย่างรวดเร็วมากที่สุดอุตสาหกรรมหนึ่ง ปัจจุบันนี้ก็เป็นยุคข้อมูลข่าวสารโดยการใช้เครื่องคอมพิวเตอร์เป็น เทคโนโลยีที่รองรับคอมพิวเตอร์ในสมัยแรก ๆ เท่านั้น  เป็นคอมพิวเตอร์ที่ถูกออกแบบให้ใช้งานแบบรวมศูนย์ (Centralized Computing) เช่น เมนเฟรม มินิคอมพิวเตอร์ เป็นต้น ซึ่งคอมพิวเตอร์จะถูกสร้าง และเก็บไว้ในห้อง ๆ หนึ่ง  เนื่องมาจากสมัยนั้นเป็นคอมพิวเตอร์ที่มีราคาแพงมาก  ผู้ใช้แต่ละคนจะใช้จอภาพ (Dump Terminal) เพื่อเชื่อมต่อเข้ากับเครื่องเมนเฟรม</font></p>
      <center><img src="image/01[1].gif" alt="Me" class="w3-image w3-padding-32" width="200" height="250"></center>
      <center><h6><font size="3" >  เมนเฟรมและดัมพ์เทอร์มินอล </font></h6></center>

      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หลังจากนั้นก็ได้มีการคิดค้นคอมพิวเตอร์ที่มีขนาดเล็ก หรือเรียกว่าไมโครคอมพิวเตอร์ (Microcomputer) ซึ่งได้มีการใช้กันอย่างแพร่หลายในปัจจุบัน เนื่องจากราคาถูกกว่าเดิมและยังมี ประสิทธิภาพไม่น้อยไปกว่าเครื่องเมนเฟรมด้วย ถ้าเครื่องคอมพิวเตอร์ที่ทำงานเดี่ยวๆ(Stand-alone) ก็จะเป็นเหมือนกับการที่คน ๆ หนึ่งทำงานเพียงคนเดียว  เป็นที่ทราบกันดีว่า   การทำงานเพียงคนเดียวนั้นจะได้ผลลัพธ์ไม่ดีเท่า ที่ควรนัก การทำงานของมนุษย์นั้นจำเป็นที่จะต้องทำงานกันเป็นกลุ่มหรือทีมถึงจะมีประสิทธิภาพได้คอมพิวเตอร์ก็เช่นกัน  ควรจะทำงานเป็นกลุ่มหรือทีม ซึ่งการทำงานเป็นกลุ่มหรือทีมของคอมพิวเตอร์นี้จะเรียกว่า “ เครือข่าย (Network) ”</font></p>

      <p><font size="4" align="left">เครือข่ายคอมพิวเตอร์คืออะไร</font></p>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;จุเครือข่ายคอมพิวเตอร์  (Computer  Network)  คือระบบที่มีคอมพิวเตอร์อย่างน้อยสองเครื่องเชื่อมต่อกันโดยใช้สื่อกลาง   และก็สื่อสารข้อมูลกันได้อย่างมีประสิทธิภาพ  ซึ่งทำให้ผู้ใช้คอมพิวเตอร์แต่ละเครื่องสามารถแลกเปลี่ยนข้อมูลซึ่งกันและกันได้ นอกจากนี้ยังสามารถใช้ทรัพยากร(Resources) ที่มีอยู่ในเครือข่ายร่วมกันได้ เช่น เครื่องพิมพ์ ซีดีรอม สแกนเนอร์ ฮาร์ดดิสก์ เป็นต้น</font></p>
	  <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;แนวคิดในการสร้างเครือข่ายคอมพิวเตอร์นั้น เริ่มมาจากการที่ผู้ใช้ต้องการที่จะแลกเปลี่ยนข้อมูลกันอย่างมีประสิทธิภาพและรวดเร็ว คอมพิวเตอร์เดี่ยวๆ เป็นอุปกรณ์ที่มีความสามารถในการประมวลผลข้อมูลในปริมาณมากอย่างรวดเร็วอยู่แล้ว แต่ข้อเสียคือ  ผู้ใช้ไม่สามารถแชร์ข้อมูลนั้นกับคนอื่นอย่างมีประสิทธิภาพได้ก่อนที่จะมีเครือข่ายคอมพิวเตอร์</p></font>

	  <h1><font color="teal">2.องค์ประกอบพื้นฐานของเครือข่าย</h1></font>
	  <p><font size="4">การที่คอมพิวเตอร์จะเชื่อมต่อกันเป็นเครือข่ายได้ ต้องมีองค์ประกอบพื้นฐานดังต่อไปนี้</font></p>
	  <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp- คอมพิวเตอร์ อย่างน้อย  2  เครื่อง</font></p>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - เน็ตเวิร์ดการ์ด  หรือ  NIC ( Network  Interface  Card) เป็นการ์ดที่เสียบเข้ากับช่องที่ เมนบอร์ดของคอมพิวเตอร์  ซึ่งเป็นจุดเชื่อมต่อระหว่างคอมพิวเตอร์และเครือข่าย
                <p>- สื่อกลางและอุปกรณ์สำหรับการรับส่งข้อมูล  เช่น  สายสัญญาณ  ส่วนสายสัญญาณที่นิยมที่ใช้กันในเครือข่ายก็เช่น  สายโคแอ็กเชียล  สายคู่เกลียวบิด  และสายใยแก้วนำแสง  เป็นต้น ส่วนอุปกรณ์ เครือข่าย  เช่น  ฮับ สวิตช์ เราท์เตอร์ เกตเวย์ เป็นต้น</p>
                <p>- โปรโตคอล  ( Protocol) โปรโตคอลเป็นภาษาที่คอมพิวเตอร์ใช้ติดต่อสื่อสารกันผ่านเครือข่ายคอมพิวเตอร์ที่สามารถสื่อสารกันได้นั้นจำเป็นที่ต้องใช้  “ภาษา” หรือใช้โปรโตคอลเดียวกันเช่น  OSI,  TCP/IP,  IPX/SPX เป็นต้น</p>
                <p>- ระบบปฏิบัติการเครือข่าย  หรือ NOS (Network Operating System)ระบบปฏิบัติการเครือข่ายจะเป็นตัวคอยจัดการเกี่ยวกับการใช้งานเครือข่ายของผู้ใช้แต่ละคน</p></font></p>

      <h1><font color="teal">3.การจำแนกประเภทของเครือข่าย</h1></font>
	  <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เครือข่ายสามารถจำแนกออกได้เป็นหลายประเภทแล้วแต่เกณฑ์ที่ใช้ คล้ายกับการจำแนกของ รถยนต์ ถ้าใช้ขนาดเป็นเกณฑ์ จะสามารถแบ่งออกได้ โดยทั่วไปจำแนกประเภทของเครือข่ายมีอยู่  3  วิธีคือ</font></p>
	  <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. ประเภทของเครือข่ายแบ่งตามขนาดทางภูมิศาสตร์</font></p>
	  <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. ถ้าใช้ขนาดทางกายภาพเป็นเกณฑ์  เครือข่ายก็ต้องสามารถแบ่งออกได้เป็นสองประเภทคือ  LAN หรือเครือข่ายท้องถิ่น และ MAN หรือเครือข่ายในบริเวณกว้าง LAN เป็นเครือข่ายที่มีใช้ในขนาดเล็กที่ครอบคลุมพื้นที่ในบริเวณจำกัด เช่น  ภายในห้อง หรือภายในอาคาร  หรืออาจครอบคลุมไปถึงหลายอาคารที่อยู่ในบริเวณใกล้เคียง เช่น ในวิทยาเขตของมหาวิทยาลัย ซึ่งบางทีเรียกว่า “เครือข่ายวิทยาเขต(Campus  Network ) ”  จำนวนของคอมพิวเตอร์ที่เชื่อมต่อกันใน  LAN   อาจมีตั้งแต่สองพันเครื่องไปจนถึงหลายพันเครื่อง  แต่ในส่วนของ WAN เป็นเครือข่ายที่ครอบคลุมบริเวณกว้าง เช่น ในพื้นที่เมือง หรืออาจจะ ครอบคลุมทั่วโลกก็ได้ เช่น เครือข่ายอินเตอร์เน็ต</font></p>
	  <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1.1  เครือข่ายท้องถิ่น  (Local Area Network หรือ Lan)  เป็นเครือข่ายระยะใกล้ใช้กันอยู่ในบริเวณที่ไม่กว้างมากนัก  อาจอยู่ในองค์กรเดียวกัน  หรืออาคารที่ใกล้กัน 
	  	<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1  อีเธอร์เน็ต  Ethernet
		อีเธอร์เน็ต  (Ethernet ) เป็นชื่อที่เรียกวิธีการสื่อสารในระดับล่างหรือที่เราเรียกว่า โปรโตคอล (Protocol)  ในระบบ LAN ชนิดหนึ่ง ที่พัฒนาขึ้นโดย 3 บริษัทใหญ่</p> 
		<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2 โทเคนริง  (Token Ring)
		IEEE 802.5 หรือโทเคนริง (Token Ring) หรือมักจะเรียกอีกอย่างว่า ไอบีเอ็มโทเคนริง จัดเป็นเครือข่ายที่ใช้ในโทโปโลยีแบบวงแหวนนี้ด้วยสายคู่บิดเกลียว หรือเส้นใยนำแสง</p>
		<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3  ATM  ย่อมาจากคำว่า“ Asynchronous Transfer Mode” ไม่ได้มีความหมายถึงตู้ATM ( Automatic  Teller  Machine) ที่เราใช้ถอนเงินสดจากธนาคาร แต่บางทีตู้ ATM ที่เราใช้ถอนเงินสดอาจจะเชื่อมต่อ เข้าศูนย์กลางด้วยระบบเครือข่ายแบบ ATM   ก็ได้  ATM เป็นมาตรฐานการรับส่งข้อมูลที่กำหนดโดยITU-T  (International  Telecommunication  Union-Telecommunication  Standard  Sector)</p></p></font></p>

      <center><img src="image/012[1].gif" alt="Me" class="w3-image w3-padding-32" width="200" height="250"></center>
      <center><h6><font size="3" >  ระบบเครือข่ายแบบกว้าง (Wide Area Network: WAN)
	 </font></h6></center>

	  <p><font size="4">ระบบเครือข่ายแบบกว้าง (Wide Area Network: WAN)</font></p>
	<p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ในระบบเครือข่าย   WAN  แบบบริเวณกว้าง  โดยส่วนใหญ่แล้วก็จะเป็นเครือข่ายที่ระยะไกลเป็นระบบเครือข่ายที่เชื่อมโยงเครือข่ายแบบท้องถิ่นตั้งแต่ 2 เครือข่ายขึ้นไปเข้าไว้ด้วยกันโดยผ่านระยะทางที่ไกลมาก  โดยทั่วไปอาศัยสายโทรศัพท์ขององค์การโทรศัพท์   และคลื่นไมโครเวฟ  เป็นตัวกลางในการรับ-ส่งข้อมูล ระบบนี้เสียค่าใช้จ่ายมากกว่าแบบแรก</font></p>

      <p><font size="4">2.ประเภทของเครือข่ายแบ่งตามหน้าที่ของคอมพิวเตอร์</font></p>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ในระบบเครือข่าย   WAN  ที่กล่าวมาข้างต้น เป็นเพียงการจำแนกประเภทของเครือข่ายตามขนาดพื้นที่ที่ครอบคลุมถึงเท่านั้น  การจำแนกประเภทของเครือข่ายยังสามารถจำแนกได้  โดยใช้ลักษณะการแชร์ข้อมูลของคอมพิวเตอร์  หรือหน้าที่ของคอมพิวเตอร์ในแต่ละเครือข่ายเป็นเกณฑ์  เพื่อเป็นการแบ่งประเภทของเครือข่าย ซึ่งเมื่อใช้หลักการนี้แล้วเราสามารถแบ่งเครือข่ายออกได้เป็น  2  ประเภทคือ </font></p>
      	<p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2.1 เครือข่ายแบบเพียร์ทูเพียร์  (Peer – To - Peer)
		โดยเป็นการเชื่อมต่อของเครื่องทุกเครื่องที่ใช้ในระบบเครือข่าย  และยังมีสถานะเท่าเทียมกันหมด โดยเป็นเครื่องทุกเครื่องสามารถเป็นได้ทั้งเครื่องผู้ใช้บริการและผู้ให้เครื่องบริการในขณะใดขณะหนึ่ง</font></p>
		<p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2.2   เครือข่ายแบบไคลเอนท์เซิร์ฟเวอร์ (Client/Server  Network)
		ถ้าระบบเครือข่ายมีคอมพิวเตอร์ไม่มากนัก ควรสร้างเครือข่ายแบบเพียร์ทูเพียร์  เนื่องจากง่ายและค่าใช้จ่ายจะถูกกว่า  แต่เมื่อเครือข่ายนั้นมีการขยายใหญ่ขึ้นจำนวนผู้ใช้ก็มากขึ้นเช่นกัน  การดูแลและการจัดการระบบก็จะซับซ้อนมากยิ่งขึ้น เครือข่ายจำเป็นที่ต้องมีเซิร์ฟเวอร์ทำหน้าที่จัดการเรื่องต่างๆ และให้บริการอื่นๆ เครื่องเซิร์ฟเวอร์นั้นก็ควรที่จะเป็นเครื่องที่มีประสิทธิภาพที่สูงขึ้น และสามารถบริการให้ผู้ใช้ได้หลายๆ คนในเวลาเดียวกันได้</font></p>
		<p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2.3  ประเภทของเซิร์ฟเวอร์ที่ให้บริการแบบต่าง ๆ
		ก.    ไฟล์เซิร์ฟเวอร์  (File Server)
		เป็นเซิร์ฟเวอร์ที่ทำหน้าที่ในการจัดเก็บไฟล์ จะเสมือนฮาร์ดดิสก์รวมศูนย์ (Cauterized disk storage)  เสมือนว่าผู้ใช้งานทุกคนมีที่เก็บข้อมูลอยู่ที่เดียว  เพราะควบคุม-บริหารง่าย การสำรองข้อมูลโดยการ Restore ง่าย 
		ข.   พรินต์เซิร์ฟเวอร์  Print  Server
		หนึ่งเหตุผลที่จะต้องมี  Print Server  ก็คือ เพื่อแบ่งให้พรินเตอร์ราคาแพงบางรุ่นที่ออกแบบมาใช้สำหรับการทำงานมาก ๆ เช่น HP Laser 5000 พิมพ์ได้ถึง 10 - 24 แผ่นต่อนาที พรินเตอร์สำหรับประเภทนี้  ความสามารถในการทำงานที่จะสูง
		ค.   แอพพลิเคชั่นเซิร์ฟเวอร์  (Application  Server)
		Application  Server  คือ เซิร์ฟเวอร์ที่รันโปรแกรมประยุกต์ได้ โดยการทำงานสอดคล้องกับไคลเอ็นต์  เช่น  Mail  Server  ( รัน  MS  Exchange  Server )  Proxy  Server  (รัน Proxy Server)  หรือ Web Server  (รัน Web Server Program เช่น Xitami , Apache' )
		ง.    อินเตอร์เน็ตเซิร์ฟเวอร์  (Internet  Server)
		 ปัจจุบันอินเตอร์เน็ตนั้น มีผลกระทบกับเครือข่ายในปัจจุบันเป็นอย่างมาก อินเตอร์เน็ตเป็นเครือข่ายที่มีขนาดใหญ่มากและมีผู้ใช้งานมากที่สุดในโลก เทคโนโลยีที่ทำให้อินเตอร์เน็ตเป็นที่นิยมก็คือ เว็บ และอีเมลล์ เพราะทั้งสองแอพพลิเคชั่นทำให้ผู้ใช้สามารถแลกเปลี่ยนข้อมูลและสื่อสารกันได้ง่ายและมีรวดเร็ว
		-      เว็บเซิร์ฟเวอร์  (Web  Server)  คือ  เซิร์ฟเวอร์ที่ให้บริการข้อมูลในรูปแบบ  HTML  (Hyper text  Markup Language) 
		-       เมลเซิร์ฟเวอร์  (Mail Server)  คือ เซิร์ฟเวอร์ที่ให้บริการรับ - ส่ง จัดเก็บ และจัดการเกี่ยวกับอีเมลของผู้ใช้ </font></p></font></p>

		<p><font size="4">3.   ประเภทของเครือข่ายแบ่งตามระดับความปลอดภัยของข้อมูล</font></p>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; อีกวิธีหนึ่งในการแบ่งประเภทของเครือข่ายคือ  การใช้ระดับความปลอดภัยของข้อมูล  ซึ่งจะแบ่งออกได้เป็น 3 ประเภทด้วยกันก็คือ อินเตอร์เน็ต (Internet) ,อินทราเน็ต (Intranet) ,เอ็กส์ตราเน็ต (Extranet ) </font></p>

      <p><font size="4">3.1  อินเตอร์เน็ต(Internet)</font></p>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; อินเตอร์เน็ต  (Internet) นั้นเป็นเครือข่ายคอมพิวเตอร์     ที่นำก่อตั้งโดยกระทรวงกลาโหม ประเทศสหรัฐอเมริกา  อินเตอร์เน็ตในสมัยยุคแรก ๆ เมื่อประมาณปี  พ.ศ. 2512   เป็นเพียงการนำคอมพิวเตอร์จำนวนไม่กี่เครื่องนั้นมาเชื่อมต่อกันเท่านั้น โดยมีเพียงสายส่งสัญญาณ เพื่อแลกเปลี่ยนข้อมูลระหว่างเครื่องคอมพิวเตอร์ </font></p>

      <p><font size="4">3.2  อินทราเน็ต (Internet)</font></p>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ตรงกันข้ามกับอินเตอร์เน็ต  อินทราเน็ตเป็นเครือข่ายส่วนบุคคลที่ใช้เทคโนโลยีอินเตอร์เน็ต  เช่น เว็บ,อีเมลล์,FTP แต่อินทราเน็ตใช้โปรโตคอล TCP/IP แต่ใช้สำหรับการรับ- ส่งข้อมูลเช่นเดียวกับอินเตอร์เน็ตซึ่งโปรโตคอลนี้สามารถใช้ได้กับฮาร์ดแวร์หลายประเภท และสายสัญญาณหลายประเภทฮาร์ดแวร์ที่ใช้สร้างเครือข่ายนี้ไม่ใช่ปัจจัยหลักของอินทราเน็ต แต่เป็นซอร์ฟแวร์ที่มีมาให้อินทราเน็ตทำงานได้  อินทราเน็ตเป็นเครือข่ายที่องค์กรสร้างขึ้น  สำหรับให้กับพนักงานขององค์กรที่ใช้เพียงเท่านั้น</font></p>

      <p><font size="4">3.3  เอ็กส์ตราเน็ต  (Extranet)</font></p>
      <p><font size="4">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; เอ็กส์ตราเน็ต(Extranet) เป็นเครือข่ายแบบกึ่งอินเตอร์เน็ตกึ่งอินทราเน็ต    เอ็กส์ตราเน็ต คือ  เครือข่ายที่เชื่อมต่อระหว่างอินทราเน็ตของ 2 องค์กร  ดังนั้นจะมีบางส่วนของเครือข่ายที่เป็นเจ้าของร่วมกันระหว่าง 2 องค์กรหรือบริษัท การสร้างอินทราเน็ตจะไม่จำกัดด้วยเทคโนโลยี แต่จะยากตรงนโยบายที่เกี่ยวกับการรักษาความปลอดภัยของข้อมูลที่ทั้ง 2 องค์กรจะต้องตกลงกัน  การสร้างเอ็กส์ตราเน็ตจะเน้นที่ระบบการรักษาความปลอดภัยข้อมูลกับรวมถึงการติดตั้งไฟร์วอลหรือ ระหว่างอินทราเน็ตและการเข้ารหัสข้อมูลและสิ่งที่สำคัญที่สุดก็คือ  นโยบายการรักษาความปลอดภัยข้อมูลและการบังคับใช้ 
</font></p>


		</div>
	</div>
</div>
</div>
<?php include("footer.php"); ?>