 <?php include("header.php"); ?>

<div class="w3-container w3-padding-32 ">
  <div class="w3-content">
    <h1 class="w3-center w3-jumbo" style="margin-bottom:40px">About Me</h1>
    <br><strong>NAMWARN</strong> Ms. Kronwarin Putthawong</p>
    <font size="5">ข้อมูลทั่วไป</font>
      <br>ชื่อ - สกุล : กรวรินทร์ พุทธวงค์ ชื่อเล่น : น้ำหวาน วันเกิด : 29 มีนาคม</br> 
      ส่วนสูง : 165 เซนติเมตร น้ำหนัก : 45 กิโลกรัม กรุ๊ปเลือด : o 
      เชื้อชาติ : ไทย สัญชาติ : ไทย ศาสนา : พุทธ สถานภาพ โสด 
      ความถนัด : ด้านกรีฬากรีฑา (วิ่ง) <br> ความชอบ : การเขียนโปรแกรม, การเรียนคณิตศาสตร์ 
      เวลาว่างชอบ : หาศัพท์ภาษาอังกฤษอ่าน อุปนิสัยส่วนตัว : เป็นคนตรง, ชอบทำอะไรจริงจัง</br>
      <img src="/image/103297.jpg" style="width:250px" class="w3-circle w3-right" alt="Chef"></p>
      <p><font size="5">ข้อมูลติดต่อ</font>
      <br>ที่อยู่ : บ้านเลขที่ 52 หมู่ 3 บ.น้ำปั้ว ต.น้ำปั้ว อ.เวียงสา จ.น่าน 55110 >> Tel:095-4563043</br></p>


      <p><font size="5">ประวัติกาารศึกษา </font>
      <br>สำเร็จการศึกษาชั้นอนุบาลจาก : โรงเรียนบ้านน้ำปั้ว
      <br>สำเร็จการศึกษาชั้นประถมจาก : โรงเรียนบ้านน้ำปั้ว 
      <br>สำเร็จการศึกษาชั้นมัธยมตอนต้นจาก : โรงเรียนตาลชุมพิทยาคม
      <br>สำเร็จการศึกษาชั้นมัธยมตอนปลายจาก : โรงเรียนศรีสวัสดิ์วิทยาคารจังหวัดน่าน
      <br>ปัจจุบันศึกษาอยู่ชั้นปีที่ 3 : มหาวิททยาลัยเนชั่น จังหวัดลำปาง</br></p> 
  </div>
</div>


<?php include("footer.php"); ?>